app/Http/Helpers.php

select * from `products` where `published` = 1 and `approved` = '1' and `auction_product` = 0 and (`added_by` = 'admin' or (`user_id` in (10, 11, 12, 13, 14, 15, 16, 17, 20, 23))) and `category_id` in (13, 59, 60, 61, 62, 63, 78, 79, 80, 81, 82, 14, 64, 65, 66, 67, 15, 68, 69, 70, 71, 72, 86, 87, 88, 89, 16, 73, 74, 17, 75, 76, 77, 93, 94, 95, 96, 244, 245, 1) order by `created_at` desc limit 12
---
    function get_cached_products($category_id = null)
    {
        $products = \App\Product::where('published', 1)->where('approved', '1')->where('auction_product', 0);
        $verified_sellers = verified_sellers_id();
        if (get_setting('vendor_system_activation') == 1) {
            $products = $products->where(function ($p) use ($verified_sellers) {
                $p->where('added_by', 'admin')->orWhere(function ($q) use ($verified_sellers) {
                    $q->whereIn('user_id', $verified_sellers);
                });
            });
        } else {
            $products = $products->where('added_by', 'admin');
        }

        if ($category_id != null) {
            return Cache::remember('products-category-' . $category_id, 86400, function () use ($category_id, $products) {
                $category_ids = CategoryUtility::children_ids($category_id);
                $category_ids[] = $category_id;
                return $products->whereIn('category_id', $category_ids)->latest()->take(12)->get();

insert into `translations` (`lang`, `lang_key`, `lang_value`, `updated_at`, `created_at`) values ('en', 'Seller', 'Seller', '2021-09-12 12:41:20', '2021-09-12 12:41:20')
select `lang_value`, `lang_key` from `translations` where `lang` = 'sa'
---
function translate($key, $lang = null)
{
    if($lang == null){
        $lang = App::getLocale();
    }

    $translations_default = Cache::rememberForever('translations-'.env('DEFAULT_LANGUAGE', 'en'), function () {
        return Translation::where('lang', env('DEFAULT_LANGUAGE', 'en'))->pluck('lang_value', 'lang_key')->toArray();
    });

    if(!isset($translations_default[$key])){
        $translation_def = new Translation;
        $translation_def->lang = env('DEFAULT_LANGUAGE', 'en');
        $translation_def->lang_key = $key;
        $translation_def->lang_value = $key;
        $translation_def->save();
        Cache::forget('translations-'.env('DEFAULT_LANGUAGE', 'en'));
    }

    $translation_locale = Cache::rememberForever('translations-'.$lang, function () use ($lang) {
        return Translation::where('lang', $lang)->pluck('lang_value', 'lang_key')->toArray();
    });