app/Utility/NotificationUtility.php

select * from `users` where `user_type` = 'admin' limit 1
select * from `users` where `users`.`id` = 8 limit 1
---
    public static function sendNotification($order, $order_status)
    {
        if ($order->seller_id == \App\User::where('user_type', 'admin')->first()->id) {
            $users = User::findMany([$order->user->id, $order->seller_id]);