app/Http/Controllers/AdminController.php

select * from `categories` where `level` = 0
select sum(`num_of_sale`) as aggregate from `products` where `category_id` in (13, 59, 60, 61, 62, 63, 78, 79, 80, 81, 82, 14, 64, 65, 66, 67, 15, 68, 69, 70, 71, 72, 86, 87, 88, 89, 16, 73, 74, 17, 75, 76, 77, 93, 94, 95, 96, 244, 245, 1)
select * from `products` where `category_id` in (13, 59, 60, 61, 62, 63, 78, 79, 80, 81, 82, 14, 64, 65, 66, 67, 15, 68, 69, 70, 71, 72, 86, 87, 88, 89, 16, 73, 74, 17, 75, 76, 77, 93, 94, 95, 96, 244, 245, 1)
---
    public function admin_dashboard()
    {
        $root_categories = Category::where('level', 0)->get();

        $cached_graph_data = Cache::remember('cached_graph_data', 86400, function() use ($root_categories){
            $num_of_sale_data = null;
            $qty_data = null;
            foreach ($root_categories as $key => $category){
                $category_ids = \App\Utility\CategoryUtility::children_ids($category->id);
                $category_ids[] = $category->id;

                $products = Product::with('stocks')->whereIn('category_id', $category_ids)->get();
                $qty = 0;
                $sale = 0;
                foreach ($products as $key => $product) {
                    $sale += $product->num_of_sale;
                    foreach ($product->stocks as $key => $stock) {
                        $qty += $stock->qty;
                    }
                }
                $qty_data .= $qty.',';
                $num_of_sale_data .= $sale.',';
            }
            $item['num_of_sale_data'] = $num_of_sale_data;
            $item['qty_data'] = $qty_data;