app/Http/Controllers/CheckoutController.php

select * from `carts` where `user_id` = 8
select * from `categories`
---
    public function get_shipping_info(Request $request)
    {
        $carts = Cart::where('user_id', Auth::user()->id)->get();
//        if (Session::has('cart') && count(Session::get('cart')) > 0) {
        if ($carts && count($carts) > 0) {
            $categories = Category::all();

select * from `carts` where `user_id` = 8
update `carts` set `address_id` = '4', `carts`.`updated_at` = '2021-09-12 12:57:46' where `id` = 3
---
    public function store_shipping_info(Request $request)
    {
        if($request->no_address=='no')
        {
        if ($request->address_id == null) {
            flash(translate("Please add shipping address"))->warning();
            return back();
        }
        }

        $carts = Cart::where('user_id', Auth::user()->id)->get();

        foreach ($carts as $key => $cartItem) {
            $cartItem->address_id = $request->address_id;
            $cartItem->save();