app/Http/Controllers/OrderController.php

select * from `orders` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `orders`
---
    public function all_orders(Request $request)
    {
        CoreComponentRepository::instantiateShopRepository();

        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;

        $orders = Order::orderBy('id', 'desc');
        if ($request->has('search')) {
            $sort_search = $request->search;
            $orders = $orders->where('code', 'like', '%' . $sort_search . '%');
        }
        if ($request->delivery_status != null) {
            $orders = $orders->where('delivery_status', $request->delivery_status);
            $delivery_status = $request->delivery_status;
        }
        if ($date != null) {
            $orders = $orders->where('created_at', '>=', date('Y-m-d', strtotime(explode(" to ", $date)[0])))->where('created_at', '<=', date('Y-m-d', strtotime(explode(" to ", $date)[1])));
        }
        $orders = $orders->paginate(15);

select * from `users` where `user_type` = 'admin' limit 1
select * from `orders` where `seller_id` = 9 order by `id` desc limit 15 offset 0
select count(*) as aggregate from `orders` where `seller_id` = 9
---
    public function admin_orders(Request $request)
    {
        CoreComponentRepository::instantiateShopRepository();

        $date = $request->date;
        $payment_status = null;
        $delivery_status = null;
        $sort_search = null;
        $admin_user_id = User::where('user_type', 'admin')->first()->id;
        $orders = Order::orderBy('id', 'desc')
                        ->where('seller_id', $admin_user_id);

        if ($request->payment_type != null) {
            $orders = $orders->where('payment_status', $request->payment_type);
            $payment_status = $request->payment_type;
        }
        if ($request->delivery_status != null) {
            $orders = $orders->where('delivery_status', $request->delivery_status);
            $delivery_status = $request->delivery_status;
        }
        if ($request->has('search')) {
            $sort_search = $request->search;
            $orders = $orders->where('code', 'like', '%' . $sort_search . '%');
        }
        if ($date != null) {
            $orders = $orders->whereDate('created_at', '>=', date('Y-m-d', strtotime(explode(" to ", $date)[0])))->whereDate('created_at', '<=', date('Y-m-d', strtotime(explode(" to ", $date)[1])));
        }

        $orders = $orders->paginate(15);

select * from `users` where `city` = 'Sed ea dolore offici' and `user_type` = 'delivery_boy'
---
    public function show($id)
    {
        $order = Order::findOrFail(decrypt($id));
        $order_shipping_address = json_decode($order->shipping_address);
        $delivery_boys = User::where('city', $order_shipping_address->city)
            ->where('user_type', 'delivery_boy')
            ->get();

select * from `users` where `user_type` = 'admin' limit 1
---
    public function seller_orders(Request $request)
    {
        CoreComponentRepository::instantiateShopRepository();

        $date = $request->date;
        $seller_id = $request->seller_id;
        $payment_status = null;
        $delivery_status = null;
        $sort_search = null;
        $admin_user_id = User::where('user_type', 'admin')->first()->id;

select * from `carts` where `user_id` = 8
select * from `addresses` where `id` = 4 limit 1
insert into `combined_orders` (`user_id`, `shipping_address`, `updated_at`, `created_at`) values (8, '{\"id\":4,\"user_id\":8,\"address\":\"Lorem placeat ut ve\",\"country\":\"Namibia\",\"city\":\"Sed ea dolore offici\",\"longitude\":null,\"latitude\":null,\"postal_code\":\"Et et dolore officia\",\"phone\":\"+1 (497) 761-6512\",\"set_default\":1,\"created_at\":\"2021-02-23T21:18:11.000000Z\",\"updated_at\":\"2021-03-08T11:07:40.000000Z\",\"name\":\"Mr. Customer\",\"email\":\"customer@example.com\"}', '2021-09-12 12:55:10', '2021-09-12 12:55:10')
---
    public function store(Request $request)
    {
        $carts = Cart::where('user_id', Auth::user()->id)
            ->get();

        if ($carts->isEmpty()) {
            flash(translate('Your cart is empty'))->warning();
            return redirect()->route('home');
        }
        $shipping_info=array();
        if($carts[0]['shipping_type']!='pickup_store')
        {
        $shipping_info = Address::where('id', $carts[0]['address_id'])->first();
        $shipping_info->name = Auth::user()->name;
        $shipping_info->email = Auth::user()->email;
        if ($shipping_info->latitude || $shipping_info->longitude) {
            $shipping_info->lat_lang = $shipping_info->latitude . ',' . $shipping_info->longitude;
        }
        }
        else
        {
        $shipping_info = Address::where('user_id', Auth::user()->id)->first();
        $shipping_info->address='';
        $shipping_info->name = Auth::user()->name;
        $shipping_info->email = Auth::user()->email;
        }

        $combined_order = new CombinedOrder;
        $combined_order->user_id = Auth::user()->id;
        $combined_order->shipping_address = json_encode($shipping_info);
        $combined_order->save();

insert into `orders` (`combined_order_id`, `user_id`, `shipping_address`, `payment_type`, `delivery_viewed`, `payment_status_viewed`, `code`, `date`, `updated_at`, `created_at`) values (29, 8, '{\"id\":4,\"user_id\":8,\"address\":\"Lorem placeat ut ve\",\"country\":\"Namibia\",\"city\":\"Sed ea dolore offici\",\"longitude\":null,\"latitude\":null,\"postal_code\":\"Et et dolore officia\",\"phone\":\"+1 (497) 761-6512\",\"set_default\":1,\"created_at\":\"2021-02-23T21:18:11.000000Z\",\"updated_at\":\"2021-03-08T11:07:40.000000Z\",\"name\":\"Mr. Customer\",\"email\":\"customer@example.com\"}', 'stripe', '0', '0', '20210912-12551059', 1631451310, '2021-09-12 12:55:10', '2021-09-12 12:55:10')
---
            $order->payment_status_viewed = '0';
            $order->code = date('Ymd-His') . rand(10, 99);
            $order->date = strtotime('now');
            $order->save();

update `product_stocks` set `qty` = 4980, `product_stocks`.`updated_at` = '2021-09-12 12:55:10' where `id` = 294
---
                    return redirect()->route('cart')->send();
                } elseif ($product->digital != 1) {
                    $product_stock->qty -= $cartItem['quantity'];
                    $product_stock->save();

insert into `order_details` (`order_id`, `seller_id`, `product_id`, `variation`, `price`, `tax`, `shipping_type`, `product_referral_code`, `shipping_cost`, `quantity`, `updated_at`, `created_at`) values (75, 9, 132, 'Black', 600, 0, 'home_delivery', '', 5, 1, '2021-09-12 12:55:10', '2021-09-12 12:55:10')
update `products` set `num_of_sale` = 17, `products`.`updated_at` = '2021-09-12 12:55:10' where `id` = 132
---
                //End of storing shipping cost

                $order_detail->quantity = $cartItem['quantity'];
                $order_detail->save();

                $product->num_of_sale = $product->num_of_sale + $cartItem['quantity'];
                $product->save();

update `orders` set `seller_id` = 9, `grand_total` = 605, `orders`.`updated_at` = '2021-09-12 12:55:10' where `id` = 75
update `combined_orders` set `grand_total` = 665, `combined_orders`.`updated_at` = '2021-09-12 12:55:10' where `id` = 29
---
                $coupon_usage->save();
            }

            $order->save();
        }

        $combined_order->save();