app/Http/Controllers/SearchController.php

select * from `attributes`
select * from `colors`
---
    public function index(Request $request, $category_id = null, $brand_id = null,$linked = null,$pid=null,$seller=null,$location=null)
    {
        $query = $request->keyword;
        $sort_by = $request->sort_by;
        $min_price = $request->min_price;
        $max_price = $request->max_price;
        $seller_id = $request->seller_id;
        $attributes = Attribute::all();
        $selected_attribute_values = array();
        $locationfilter=array();
        $brandfilter=array();
        $colors = Color::all();